#!/usr/bin/env ruby
#
# Homebrew Bundle file
# - https://github.com/Homebrew/homebrew-bundle
#

# Pre-requisites
brew 'git'
brew 'make'
brew 'stow'
brew 'gcc'

# Bash
brew 'bash'
brew 'bash-completion@2'

# Zsh
brew 'zsh'
brew 'zsh-autosuggestions'
brew 'zsh-completions'
brew 'zsh-history-substring-search'
brew 'zsh-syntax-highlighting'

# Core shell packages
brew 'direnv'
brew 'fasd'
brew 'fzf'
brew 'neovim'
brew 'sk'
brew 'starship'
brew 'tmux'

# Shell enhancers
brew 'bat'
# brew 'tldr'
brew 'tree'

# Search utils
brew 'jq'
brew 'ripgrep'
brew 'yq'

# Gnu utilities
brew 'coreutils'
brew 'gpg'
# brew 'findutils'
# brew 'gettext', link: true
# brew 'gawk'
# brew 'gnu-sed'
# brew 'gnu-tar'
# brew 'gnutls'
# brew 'grep'
# brew 'gsed'
# brew 'parallel'

# System utils
# brew 'htop'
# brew 'inetutils'
# brew 'netcat'
# brew 'ncdu'
# brew 'dutree'
# brew 'openssl'
# brew 'openvpn'
brew 'wget'

# Docker
# brew 'ctop'
brew 'docker-completion'
brew 'docker-compose-completion'

# Git tools
brew 'git-open'
brew 'gh'

# Dev related
brew 'asdf'
brew 'cmake'
brew 'gcc'
brew 'yarn'

# Shell dev utils
brew 'bats-core'
brew 'shellcheck'
brew 'shfmt', link: true, overwrite: true

# Other dev tools
brew 'adr-tools'

#
# Local Brewfile's
#

Dir.glob(File.expand_path('~/.config/homebrew/Brewfile.*')).each do |file|
  next if file.end_with?('.lock.json')
  instance_eval File.read(file) if File.exists?(file)
end

#
# Only macOS beyond here
#

require 'os'
return unless OS.mac?

# macOS specific taps
tap 'homebrew/cask'
# tap 'homebrew/cask-drivers'
tap 'homebrew/cask-fonts'
tap 'homebrew/cask-versions'
tap 'homebrew/services'

# Caskroom apps
cask 'firefox-developer-edition'
cask 'hammerspoon'
cask 'iterm2'
cask 'karabiner-elements'

# Caskroom fonts
cask 'font-fira-code'
cask 'font-fira-mono'
