#!/usr/bin/env ruby
#
# Homebrew Bundle file
# - https://github.com/Homebrew/homebrew-bundle
#

brew 'bash'
brew 'bash-completion@2'
brew 'bat'
brew 'coreutils'
brew 'direnv'
brew 'dust'
brew 'fd'
brew 'fzf'
brew 'gh'
brew 'git'
brew 'git-delta'
brew 'gpg'
brew 'hyperfine'
brew 'htop'
brew 'jj'
brew 'jq'
brew 'lazygit'
brew 'lazyjj'
brew 'libyaml'
brew 'make'
brew 'mise'
brew 'neovim'
brew 'netcat'
brew 'ripgrep'
brew 'shellcheck'
brew 'shfmt'
brew 'starship'
brew 'stow'
brew 'testscript'
brew 'tree'
brew 'yq'
brew 'zoxide'
brew 'zsh'
brew 'zsh-autosuggestions'
brew 'zsh-completions'
brew 'zsh-history-substring-search'
brew 'zsh-syntax-highlighting'

#
# Local Brewfile's
#

Dir.glob(File.expand_path('~/.config/homebrew/Brewfile.*')).each do |file|
  next if file.end_with?('.lock.json')

  instance_eval File.read(file) if File.exist?(file)
end

#
# Only macOS beyond here
#

require 'os'
return unless OS.mac?

# gnu utils
# brew 'findutils'
# brew 'gettext', link: true
# brew 'gawke
# brew 'gnu-sed'
# brew 'gnu-tar'
# brew 'gnutls'
# brew 'grep'
# brew 'gsed'
# brew 'parallel'

# Caskroom fonts
cask 'font-fira-code'
cask 'font-fira-code-nerd-font'
cask 'font-fira-mono'

# Caskroom apps
cask '1password-cli'
cask 'beyond-compare'
cask 'discord'
cask 'firefox@developer-edition'
cask 'ghostty@tip'
cask 'hammerspoon'
cask 'karabiner-elements'
cask 'keymapp'
cask 'obs'
cask 'obsidian'
cask 'visual-studio-code'
cask 'zed'

# other
# cask '1password'
# cask 'google-chrome'
# cask 'slack'
