#!/usr/bin/env ruby
#
# Homebrew Bundle file
# - https://github.com/Homebrew/homebrew-bundle
#

#
# Taps
#

tap 'caskroom/cask'
tap 'caskroom/fonts'
tap 'homebrew/services'
tap 'caskroom/drivers'
tap 'caskroom/versions'

#
# Brews
#

brew 'autoconf'
brew 'automake'
brew 'awscli'
brew 'bash'
brew 'coreutils'
brew 'curl'
brew 'gcc'
brew 'gettext', link: true
brew 'git'
brew 'git-extras'
brew 'gpg'
brew 'httpie'
brew 'imagemagick'
brew 'jq'
brew 'libtool'
brew 'libxml2'
brew 'libxslt'
brew 'libyaml'
brew 'openssl'
brew 'openvpn'
brew 'pandoc'
brew 'pkg-config'
brew 'readline'
brew 'syncthing'
brew 'tree'
brew 'unixodbc'
brew 'vim', args: ['--without-python', '']
brew 'zsh'

# drivers
brew 'chromedriver'

#
# Casks - Applications
#

cask 'beyond-compare'
cask 'dash'
cask 'docker'
cask 'electrum'
cask 'google-chrome'
cask 'hammerspoon'
cask 'iterm2'
cask 'kap'
cask 'keepassxc'
cask 'osxfuse'
cask 'ngrok'
cask 'postman'
cask 'powershell'
cask 'sketch'
cask 'slack'
cask 'spotify'
cask 'the-unarchiver'
cask 'typora'
cask 'veracrypt'
cask 'visual-studio-code'
cask 'vmware-fusion'

# caskroom/versions
cask 'firefoxdeveloperedition'

#
# Mac Store Applications
#

# MicrosoftOneDrive
# MicrosoftOneNote
# MicrosoftRemoteDesktop
