#!/usr/bin/env ruby
#
# Homebrew Bundle file
# - https://github.com/Homebrew/homebrew-bundle
#

brew 'bash'
brew 'bash-completion@2'
brew 'bat'
brew 'coreutils'
brew 'direnv'
brew 'fzf'
brew 'gh'
brew 'git'
brew 'gpg'
brew 'jq'
brew 'make'
brew 'neovim'
brew 'ripgrep'
brew 'starship'
brew 'stow'
brew 'tmux'
brew 'yq'
brew 'zoxide'
brew 'zsh'
brew 'zsh-autosuggestions'
brew 'zsh-completions'
brew 'zsh-history-substring-search'
brew 'zsh-syntax-highlighting'

#
# Local Brewfile's
#

Dir.glob(File.expand_path('~/.config/homebrew/Brewfile.*')).each do |file|
  next if file.end_with?('.lock.json')

  instance_eval File.read(file) if File.exist?(file)
end

#
# Only macOS beyond here
#

require 'os'
return unless OS.mac?

# macOS specific taps
# tap 'homebrew/cask'
# tap 'homebrew/cask-fonts'
# tap 'homebrew/cask-versions'
# tap 'homebrew/services'

# Caskroom fonts
cask 'font-fira-code'
cask 'font-fira-mono'

# Caskroom apps
cask 'firefox-developer-edition'
cask 'hammerspoon'
cask 'karabiner-elements'
cask 'wezterm'
